{"DatabaseName": "court_timeliness_v3", "TableInput": {"Name": "criminal_court_timeliness", "Description": "This table includes the proportion of cases completed at first listing, average number of hearings, proportion of cases by initial plea, and the mean time taken for all criminal cases sent to the magistrates' courts. This data is then broken down by timeframe, case type, and plea type.", "Owner": "matthew.laverty@justice.gov.uk", "StorageDescriptor": {"Columns": [{"Name": "year", "Type": "int", "Comment": "The calendar year"}, {"Name": "timeframe", "Type": "string", "Comment": "The data displayed is broken down both quarterly, and annually"}, {"Name": "quarter", "Type": "string", "Comment": "The quarter of the year, Jan - Mar is Q1, etc."}, {"Name": "geographical_area", "Type": "string", "Comment": "The data is broken down by geographical area: England and Wales, region and LCJB (for year 2020 onwards only). The breakdowns available are guilty plea, not guilty, no plea entered. To select all regions and LCJBs, use England and Wales"}, {"Name": "case_type", "Type": "string", "Comment": "The data contained in these pivots only includes cases that are sent for trial, this is broken down by all, indictable, triable either way, summary non-motoring, summary motoring"}, {"Name": "plea", "Type": "string", "Comment": "The data is also broken down by initial plea type. The breakdowns available are guilty plea, not guilty, no plea entered. There is no useable option to select all plea types"}, {"Name": "value", "Type": "double", "Comment": "The value relating the the selected measure and other selected filters"}, {"Name": "defendants", "Type": "int", "Comment": "Number of defendants used in the measure"}, {"Name": "measure", "Type": "string", "Comment": "Measures are: First list % (% of cases completed at first listing); Average hearings (avg no. of hearings for all cases); Plea % (proportion of cases by initial plea); Offence to completion (mean) (mean no. of days taken for all criminal cases)"}], "Location": "", "InputFormat": "", "OutputFormat": "", "Compressed": false, "NumberOfBuckets": -1, "SerdeInfo": {}, "BucketColumns": [], "SortColumns": [], "Parameters": {}, "StoredAsSubDirectories": false}, "PartitionKeys": [], "TableType": "EXTERNAL_TABLE", "Parameters": {}, "Retention": 3000}}